[
  {
    "id": 262,
    "text": "How does Ansible ensure idempotency?",
    "correct": "Ansible modules check the current state and only apply changes if the state differs from the desired configuration.",
    "diff": 70
  },
  {
    "id": 364,
    "text": "How do Immutable Infrastructure principles apply to containers?",
    "correct": "Containers should never be patched or updated in place; replace them with a new image version instead.",
    "diff": 70
  },
  {
    "id": 365,
    "text": "What is Docker Content Trust?",
    "correct": "A security feature that uses digital signatures to verify the integrity and publisher of Docker images.",
    "diff": 70
  },
  {
    "id": 425,
    "text": "How do you enforce 'Least Privilege'?",
    "correct": "Granting users and services only the minimum permissions necessary to perform their required tasks.",
    "diff": 70
  },
  {
    "id": 431,
    "text": "Which is a benefit of collaboration in DevOps?",
    "correct": "Breaking down silos between teams, leading to faster problem solving and innovation.",
    "diff": 69
  },
  {
    "id": 230,
    "text": "What is Virtualization?",
    "correct": "Creating virtual instances of computing resources (like VMs) on a single physical machine.",
    "diff": 68
  },
  {
    "id": 315,
    "text": "What is Version Control?",
    "correct": "A system that records changes to a file or set of files over time so that you can recall specific versions later.",
    "diff": 68
  },
  {
    "id": 318,
    "text": "What is 'Shift Left' security?",
    "correct": "Integrating security practices early in the development lifecycle (design/code) rather than waiting for the end.",
    "diff": 68
  },
  {
    "id": 127,
    "text": "What is the purpose of a Firewall?",
    "correct": "To monitor and control incoming and outgoing network traffic based on predetermined security rules.",
    "diff": 67
  },
  {
    "id": 176,
    "text": "What is the primary function of a WAF?",
    "correct": "To protect web applications by filtering and monitoring HTTP traffic between a web application and the Internet.",
    "diff": 67
  },
  {
    "id": 383,
    "text": "What is 'Parallel Execution' used for?",
    "correct": "Running independent jobs (like unit tests and linting) simultaneously to reduce total pipeline duration.",
    "diff": 67
  },
  {
    "id": 150,
    "text": "What is 'Spot Instance' in AWS?",
    "correct": "Unused EC2 capacity available at a significant discount, but can be interrupted with little notice.",
    "diff": 66
  },
  {
    "id": 283,
    "text": "What are Prometheus Exporters?",
    "correct": "Agents that collect and expose metrics from systems that don't output Prometheus metrics natively.",
    "diff": 66
  },
  {
    "id": 326,
    "text": "What is 'Orchestration' in DevOps?",
    "correct": "Automated configuration, coordination, and management of computer systems and software.",
    "diff": 65
  },
  {
    "id": 332,
    "text": "What is 'GitOps'?",
    "correct": "Using Git repositories as the source of truth for defining infrastructure and application state.",
    "diff": 65
  },
  {
    "id": 274,
    "text": "What is the function of an ELB?",
    "correct": "Distributes incoming application traffic across multiple targets, such as EC2 instances.",
    "diff": 64
  },
  {
    "id": 356,
    "text": "What is the difference between HPA and VPA?",
    "correct": "HPA scales the number of pods (horizontal); VPA adjusts CPU/Memory requests of existing pods (vertical).",
    "diff": 64
  },
  {
    "id": 275,
    "text": "What is Object Storage?",
    "correct": "Storage architecture that manages data as objects, suitable for unstructured data like media.",
    "diff": 63
  },
  {
    "id": 188,
    "text": "What does a Kubernetes Network Policy do?",
    "correct": "It defines how groups of Pods are allowed to communicate with each other and other network endpoints.",
    "diff": 62
  },
  {
    "id": 195,
    "text": "What defines a variable in Bash?",
    "correct": "Variables are defined without a dollar sign (e.g., `name=\"value\"`) and accessed with one (e.g., `$name`).",
    "diff": 62
  },
  {
    "id": 236,
    "text": "What does an Elastic Load Balancer (ELB) do?",
    "correct": "Distributes incoming traffic across multiple targets to improve availability.",
    "diff": 62
  },
  {
    "id": 319,
    "text": "What is 'Microservices Architecture'?",
    "correct": "Structuring an application as a collection of loosely coupled, independently deployable services.",
    "diff": 62
  },
  {
    "id": 331,
    "text": "What is 'Feature Flag/Toggle'?",
    "correct": "A technique that allows you to turn features on or off without deploying new code.",
    "diff": 62
  },
  {
    "id": 263,
    "text": "What is cloud computing?",
    "correct": "The on-demand delivery of computing services over the internet with pay-as-you-go pricing.",
    "diff": 61
  },
  {
    "id": 185,
    "text": "What is a MAC address?",
    "correct": "A unique hardware identifier assigned to network interfaces for communication at the Data Link Layer.",
    "diff": 60
  },
  {
    "id": 231,
    "text": "What does a 'Multi-Cloud' strategy involve?",
    "correct": "Using services from multiple cloud providers (e.g., AWS + Azure) to avoid vendor lock-in.",
    "diff": 60
  },
  {
    "id": 268,
    "text": "What is Virtualization?",
    "correct": "Creating virtual instances of servers, storage, or networks on a single physical server.",
    "diff": 60
  },
  {
    "id": 285,
    "text": "What is Grafana mainly used for?",
    "correct": "Visualizing time-series data from sources like Prometheus via interactive dashboards.",
    "diff": 60
  },
  {
    "id": 329,
    "text": "What is 'Canary Release'?",
    "correct": "Rolling out a new feature to a small subset of users to test it before a full rollout.",
    "diff": 60
  },
  {
    "id": 330,
    "text": "What is 'Dark Launching'?",
    "correct": "Releasing code to production that is turned off by a feature toggle, invisible to users.",
    "diff": 60
  },
  {
    "id": 343,
    "text": "What is 'Infrastructure Drift'?",
    "correct": "When the actual state of infrastructure deviates from the configuration defined in IaC code.",
    "diff": 60
  },
  {
    "id": 411,
    "text": "What is 'Chaos Monkey'?",
    "correct": "A tool invented by Netflix that randomly terminates instances in production to ensure that engineers implement their services to be resilient to instance failures.",
    "diff": 60
  },
  {
    "id": 125,
    "text": "What is a 'Hybrid Cloud'?",
    "correct": "A computing environment that combines a public cloud and a private cloud/on-premises infrastructure.",
    "diff": 59
  },
  {
    "id": 156,
    "text": "What function does a Subnet Mask perform?",
    "correct": "It determines which part of the IP address is the network portion and which is the host portion.",
    "diff": 59
  },
  {
    "id": 181,
    "text": "What is the main advantage of SSO (Single Sign-On)?",
    "correct": "It improves user experience and productivity by requiring only one set of credentials for multiple apps.",
    "diff": 59
  },
  {
    "id": 229,
    "text": "What describes 'Serverless Computing'?",
    "correct": "Developers run code without provisioning or managing servers; resources are allocated dynamically.",
    "diff": 59
  },
  {
    "id": 320,
    "text": "What is a 'Monolith'?",
    "correct": "An application built as a single, unified unit where all logic is tightly coupled.",
    "diff": 59
  },
  {
    "id": 357,
    "text": "What is a 'Persistent Volume Claim' (PVC)?",
    "correct": "A request for storage by a user, which consumes persistent volume (PV) resources.",
    "diff": 59
  },
  {
    "id": 439,
    "text": "What is 'Cross-Functional Team'?",
    "correct": "A group of people with different functional expertise working toward a common goal.",
    "diff": 59
  },
  {
    "id": 251,
    "text": "What is 'Latency'?",
    "correct": "The delay before a transfer of data begins following an instruction for its transfer.",
    "diff": 58
  },
  {
    "id": 324,
    "text": "What is 'Configuration Management'?",
    "correct": "The process of maintaining systems, servers, and software in a desired, consistent state.",
    "diff": 58
  },
  {
    "id": 408,
    "text": "What is an 'SLA' (Service Level Agreement)?",
    "correct": "A commitment between a service provider and a client. Particular aspects of the service – quality, availability, responsibilities – are agreed between the service provider and the service user.",
    "diff": 58
  },
  {
    "id": 211,
    "text": "What does `set -e` do in a script?",
    "correct": "It aborts the script execution immediately if any command returns a non-zero exit code.",
    "diff": 57
  },
  {
    "id": 239,
    "text": "What is a Content Delivery Network (CDN)?",
    "correct": "A distributed network of servers that caches content close to users for faster delivery.",
    "diff": 57
  },
  {
    "id": 278,
    "text": "What is an IAM Role?",
    "correct": "Grants permissions to entities (like EC2 instances) without long-term credentials.",
    "diff": 57
  },
  {
    "id": 346,
    "text": "What is 'Policy-as-Code'?",
    "correct": "Defining and enforcing security and compliance rules using code (e.g., Open Policy Agent).",
    "diff": 57
  },
  {
    "id": 305,
    "text": "What is the primary definition of DevOps?",
    "correct": "A cultural and professional movement that stresses communication, collaboration, and integration between software developers and IT operations professionals.",
    "diff": 57
  },
  {
    "id": 233,
    "text": "What is an Availability Zone (AZ)?",
    "correct": "A physically separate data center within a cloud region, designed for fault tolerance.",
    "diff": 56
  },
  {
    "id": 260,
    "text": "What is an inline script?",
    "correct": "Running a script directly inside a pipeline configuration (e.g., GitHub Actions run command).",
    "diff": 56
  },
  {
    "id": 193,
    "text": "What is a characteristic feature of Bash scripting?",
    "correct": "It is interpreted by the shell and used for automating command-line tasks in Unix-like systems.",
    "diff": 55
  }
]